<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">

<html xmlns="http://www.w3.org/1999/xhtml">
<head>
  <title>German version</title>
  <link rel="STYLESHEET" type="text/css" href="LavaStyles.css" />
  <style type="text/css" xml:space="preserve">
/*<![CDATA[*/
  i.c3 {font-weight: bold; color: Red}
  b.c2 {font-style: italic; color: Red}
  h2.c1 {text-align: center}
  /*]]>*/
      .style1
      {
          color: #FF0000;
          font-style: italic;
      }
      .style2
      {
          color: #FF0000;
          font-style: italic;
          font-weight: bold;
      }
  </style>
</head>

<body>
  <h2 class="c1"><b><span class="style1">Lava</span>-Dokumentation</b> auf Deutsch?</h2>

  <p>Wir werden manchmal nach einer deutschsprachigen Version der <b class="c2">Lava</b> Dokumentation gefragt.</p>

  <p>Leider k&#246;nnen wir uns das Erstellen und Pflegen einer zweisprachigen Dokumentation zeitlich nicht leisten.</p>

  <p>Wenn sich Freiwillige finden w&#252;rden, die das in die Hand nehmen w&#252;rden, w&#228;ren wir daher sehr dankbar. Wir w&#252;rden den Betreffenden dabei nat&#252;rlich gerne beratend zur Seite stehen und das Ergebnis &#252;ber unsere Web-Seiten zur Verf&#252;gung stellen. Das folgende deutschsprachige Papier gibt eine Einf&#252;hrung in die Grundgedanken der Lava-Entwicklung:</p>

  <p><b><a target="_blank" type="application/pdf" href="https://sourceforge.net/project/showfiles.php?group_id=93752">LavaLego.pdf</a></b> <b>(~170KB) 
      <span class="style1">Lava</span>: Programmieren im Lego-Stil.</b></p>

  <p>Eine Einf&#252;hrung in <i class="c3">Lava</i> findet man auch auf den Web-Seiten des Fachbereichs Informatik der Fachhochschule Zittau/G&#246;rlitz (Ergebnis zweier Seminare zum Thema <b class="c2">Lava</b>):<br />
  <br />
  <a target="_blank" href="http://www.inf.hs-zigr.de/~wagenkn/TI/Paradigmen/Lava/LAVA%20-%20WEB/">http://www.inf.hs-zigr.de/~wagenkn/TI/Paradigmen/Lava/LAVA%20-%20WEB/</a></p>

  <p>Man kann diese auch von <a target="_blank" href="http://www.inf.hs-zigr.de/~wagenkn/TI/Paradigmen/Lava/">http://www.inf.hs-zigr.de/~wagenkn/TI/Paradigmen/Lava/</a> als ZIP-File herunterladen.</p>

  <p>Ansonsten bleiben als Notl&#246;sung derzeit nur zwei M&#246;glichkeiten:</p>

  <ol>
    <li>Wenn es nur an einzelnen W&#246;rtern mangelt, kann man ein Web-W&#246;rterbuch, wie etwa <a target="_blank" href="http://dict.leo.org/">LEO</a>, <a target="_blank" href="http://quickdic.org/index_d.html">QuickDic</a>, oder <a target="_blank" href="http://www.geodic.de/">GEODic</a>, konsultieren, oder ein W&#246;rterbuch-Programm installieren, wie zum Beispiel die kostenlosen von <a target="_blank" href="http://www.quickdic.de">QuickDic</a> oder <a target="_blank" href="http://www.cleverlearn.com/de/">Clicktionary</a>, oder das kostenpflichtige von <a target="_blank" href="http://www.babylon.com">http://www.babylon.com</a>, . Bei den letzten beiden kann man mit einem Mausklick (meist rechte Maustaste + Hochumschaltung) die &#220;bersetzung einzelner W&#246;rter aus einem beliebigen Text (z.B. aus einer der <b class="c2">Lava</b>-Web-Seiten) bekommen.</li>

    <li>Man kann ganze Text-Passagen oder sogar Web-Seiten kostenlos Online &#252;bersetzen lassen, z.B. bei <a href="http://babelfish.altavista.com/translate.dyn" target="_blank">http://babelfish.altavista.com/translate.dyn</a>, <a href="http://www.systransoft.com/" target="_blank">http://www.systransoft.com/</a>, <a target="_blank" href="http://www.freetranslation.com/">http://www.freetranslation.com/</a>.<br />
    <br />
    Den &#220;bersetzungsdienst von Copernic kann man sehr bequem aus dem MS Internet Explorer heraus &#252;ber einen Button ansteuern, der dort integriert wird, wenn man den (ohnehin sehr empfehlenswerten, kostenlosen) Suchagenten &quot;Copernic 2001 Basic&quot; installiert. (Download von <a href="http://www.copernic.com" target="_blank">http://www.copernic.com</a>.) Es wird dann auch jede weitere Web-Seite, die man &#252;ber irgendeinen Link ansteuert, sogleich in der &#252;bersetzten Version gezeigt.<br />
    <br />
    Der gro&#223;e Nachteil dieser automatischen Web-Seiten-&#220;bersetzer ist allerdings, dass die Qualit&#228;t der &#220;bersetzungen, besonders bei Fach-Texten, noch sehr zu w&#252;nschen &#252;brig l&#228;sst: Das Ergebnis ist oft eher Anlass f&#252;r Heiterkeitsausbr&#252;che als echte Hilfe. Am ehesten zu gebrauchen sind &#220;bersetzungen von Web-Seiten, die haupts&#228;chlich nur aus einzelnen Schlagworten oder normaler (nicht-fachlicher) Umgangssprache bestehen.</li>
  </ol>

  <p>Als deutschsprachiges Diskussionsforum &#252;ber <a target="_blank" href="http://www.wikiservice.at/dse/wiki.cgi?SpracheLava">
      <span class="style2">Lava</span></a> und allgemeine Software-Entwicklungs-Probleme kann man <b><a target="_blank" href="http://www.wikiservice.at/dse/wiki.cgi?StartSeite">DseWiki</a></b> nur empfehlen.</p>
</body>
</html>
